                                   ## № 1
## Користувач вводить із клавіатури два числа (початок і кінець діапазону).
## Потрібно проаналізувати всі числа в цьому діапазоні за таким правилом: якщо число кратне 7,
## його треба виводити на екран

start = int(input("Введіть початок діапазону: "))
end = int(input("Введіть кінець діапазону: "))

for number in range(start, end):
    if number % 7 == 0:
        print(number)


                                  ## № 2
## Користувач вводить із клавіатури два числа (початок і кінець діапазону).
## Необхідно проаналізувати всі числа в цьому діапазоні. Потрібно вивести на екран:
## 1.Всі числа діапазону.
## 2.Всі числа діапазону в спадному порядку.
## 3.Всі числа, кратні 7.
## 4.Кількість чисел, кратних 5.

start = int(input("Введіть початок діапазону: "))
end = int(input("Введіть кінець діапазону: "))

print("Всі числа діапазону: ")
for number in range(start, end+1):
    print(number, end=" ")
    print()

print("Всі числа діапазону в спадному порядку: ")
for number in range(end, start-1, -1):
    print(number, end=" ")
    print()

print("Всі числа кратні 7: ")
for number in range(start, end+1):
    if number % 7 == 0:
        print(number, end=" ")
        print()

print("Кількість чисел кратних 5: ")
count = 0
for number in range(start, end+1):
    if number % 5 == 0:
        count += 1
        print(count)

                                ## № 3
## Користувач вводить із клавіатури два числа (початок і кінець діапазону).
## Потрібно проаналізувати всі числа в цьому діапазоні.
## Виведення на екран має відбуватися за правилами, зазначеними нижче.

## Якщо число кратне 3 (ділиться на 3 без залишку), потрібно вивести слово "Fizz".
## Якщо число кратне 5, потрібно вивести слово "Buzz".
## Якщо число кратне 3 і 5, потрібно вивести "Fizz Buzz".
## Якщо число не кратне ні 3, ні 5, потрібно вивести саме число.

start = int(input("Введіть початок діапазону: "))
end = int(input("Введіть кінець діапазону: "))

for number in range(start, end+1):
    if number % 3 == 0:
        print("Fizz")
    elif number % 5 == 0:
        print("Buzz")
    elif number % 3 and number % 5 == 0:
        print("Fizz Buzz")
    else:
        print(number)

